Revit 2027 API
ElementType.CanBeCopied Property
 Determine if this ElementType can create a copy
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool CanBeCopied { get; }
Public ReadOnly Property CanBeCopied As Boolean
	Get
public:
property bool CanBeCopied {
	bool get ();
}
member CanBeCopied : bool with get
Property Value
Boolean
See Also
Reference
ElementType Class
Autodesk.Revit.DB Namespace